# CREATE
a = 'Привет'  # Одиночные кавычки
b = "привет"  # Двойные кавычки
c = "Я 'знаю' Python"  # Комбинирование
d = 'я "знаю" Python'  # Можно и так
e = 'я"знаю' Python"  #так нельзя
a = 123 # цифры
a = str(a) # результат а
str([1, 1.1, 'a'])
str(True)
str(None)
a = 'привет'
print(a)
print('ДЖО-ЖО')
a = 'привет'
print(a)
print('Иван')
а = "привет" a[0] # 'n' a[1] # 'p'
a[0] # 'п'
a[1] # 'р'
a[2] # 'и'
a[3] # 'в'
a[4] # 'e'
a[5] # 'T'
[6] # Ошибка, вышли за границы
a[-1] # 'T'
a[-2] # 'e'
a[-3] # 'B'
a[-4] # 'и'
a[-5] # 'p'
a[-6] # 'п'
а[-7] # Ошибка, вышли за границы